app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4674]]
SELECT COUNT(DISTINCT count_column) FROM (SELECT  DISTINCT "users"."id" AS count_column FROM "users" LEFT OUTER JOIN "user_groups" ON "user_groups"."user_id" = "users"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "user_groups"."group_id" WHERE "groups"."name" IN ('authorized') LIMIT 25 OFFSET 0) subquery_for_count
---
  def find_similar
    @user = User.find(params[:id])
    @users = users(User.joins(:profile).where("users.id != ? AND (email = ? or CONCAT(last_name, ' ', first_name, ' ', middle_name) = ?)",
                                              @user.id, @user.email, @user.full_name).page(params[:page]))

SELECT  DISTINCT "users".* FROM "users" LEFT OUTER JOIN "user_groups" ON "user_groups"."user_id" = "users"."id" LEFT OUTER JOIN "groups" ON "groups"."id" = "user_groups"."group_id" WHERE "groups"."name" IN ('authorized')  ORDER BY "users"."id" DESC LIMIT 25 OFFSET 0
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" IN (4675, 4674, 4673, 4672, 4671, 4670, 4669, 4668, 4667, 4666, 4665, 4664, 4663, 4662, 4661, 4660, 4659, 4658, 4657, 4656, 4655, 4654, 4653, 4652, 4651)
---
  def index
    respond_to do |format|
      format.html do
        @search = User.includes({ employments: %i[organization organization_department] }, :profile)
                      .select('users.*, profiles.last_name')
                      .left_joins(:profile).ransack(params[:q])