app/controllers/admin/users_controller.rb

SELECT "core_organization_departments".* FROM "core_organization_departments" WHERE "core_organization_departments"."id" IN (355, 453, 192, 649, 598, 499, 652, 370, 344, 81, 91)
SELECT "core_organizations".* FROM "core_organizations" WHERE "core_organizations"."id" IN (1055, 990, 1200, 209, 1126, 1202, 815, 346, 497)
---
  def index
    @search = User.includes({employments:[:organization,:organization_department]}, :profile).search(params[:q])