engines/announcements/app/views/announcements/admin/announcements/show_users.html.slim

  = f.autocomplete_field :id_eq, source:  main_app.users_path, label: t('.user') do |id|
    - Announcements.user_class.find(id).full_name_with_email
---
SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "users".id FROM "users" INNER JOIN "announcement_recipients" ON "users"."id" = "announcement_recipients"."user_id" WHERE "announcement_recipients"."announcement_id" = $1  [["announcement_id", 2]]

                  { label: t('.participated_project_statuses') })
  /= f.collection_select :available_projects_available_clusters_id_eq, Announcements.cluster_class.all, :id, :name, label: t('.has_account_on_clusters'), include_blank: true
---
SELECT "core_clusters".* FROM "core_clusters"