app/controllers/lang_prefs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4674]]
UPDATE "users" SET "language" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["language", "en"], ["updated_at", "2018-08-10 10:51:05.509533"], ["id", 4674]]
---
  def change
    if session[:soul_id]
      User.find(session[:soul_id]).update!(language: language_param)