app/views/admin/users/_table.html.slim

SELECT "core_employments".* FROM "core_employments" WHERE "core_employments"."user_id" IN (4675, 4674, 4673, 4672, 4671, 4670, 4669, 4668, 4667, 4666, 4665, 4664, 4663, 4662, 4661, 4660, 4659, 4658, 4657, 4656, 4655, 4654, 4653, 4652, 4651)
---
      td
        - if user.employments.any?